code-review/NRB_3471_3546/База_Стало/Reports/ВыпискаОбОперацияхСчетамДепо_Новая.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ВыпискаОбОперацияхСчетамДепо_Новая</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХОтбор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документооборот</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыпискаДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьФаксимилеВОтчетах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыКЭДО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
								<v8:Type>cfg:DocumentRef.СводныйОтчетОСовершенныхОперациях</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
								<v8:Type>cfg:DocumentRef.СводныйОтчетОСовершенныхОперациях</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресТаблицы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭДО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ActionType</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/AccumulationRegisters/ОстаткиЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦБ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусЦБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/AccumulationRegisters/ЦБВПути.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЦБВПути</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительКадровойСлужбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаНалоговыеРегистры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УполномоченныйПредставитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписантОтчетовПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контролер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписантСПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенеральныйДиректор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаОсобыхКлиентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписантВРегуляторнойОтчетности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительВРегуляторнойОтчетности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/СтатусыЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЦБ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Свободна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Блокирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заложена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обременена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ВидыСчетовДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСчетовДепо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СчетДЕПО</Name>
					<Comment>Счет для учета ценных бумаг</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетНФИ</Name>
					<Comment>Счет для учета финансовых инструментов, неклассифицированных как ценные бумаги</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Catalogs/ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыОпераций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлассОпераций</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АнглийскоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДвижениеПоЦБ</Name>
					<Comment>Включает движения по регистрам ОстаткиЦБДепозитарийМХ и ОстаткиЦБМестоРасчетов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплатаДоходаВДенежнойФорме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОперацииИФИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/ВыпискаОбОперацияхСчетамДепо_Новая/Ext/ObjectModule.bsl
Перем ТаблицаЗначенийОстаткиНаКонец, ТаблицаЗначенийОперации;
Перем мТекстыЗаголовков;

// ВЫБОРКА
Процедура ЗаполнитьПараметрыЗапросаПоОтборуСКД(Запрос)
	
	СравнениеКлиент		= "(СчетДепо.Владелец ВидСравнения (&Клиент)	ИЛИ &НеПроверятьКлиента)";
	СравнениеСчетДепо	= "(СчетДепо ВидСравнения (&СчетДепо)			ИЛИ &НеПроверятьСчетаДепо)";
	СравнениеЭмитент	= "(ЦБ.Эмитент ВидСравнения (&Эмитент)			ИЛИ &НеПроверятьЭмитента)";
	СравнениеЦБ			= "(ЦБ ВидСравнения (&ЦБ)						ИЛИ &НеПроверятьЦБ)";
	
	СписокКлиентов		= Новый СписокЗначений;
	СписокСчетовДепо	= Новый СписокЗначений;
	СписокЭмитентов		= Новый СписокЗначений;
	СписокЦБ			= Новый СписокЗначений;
	
	// заполним структуру параметров на основании данных отбора
	ЭлементыОтбора = ЭтотОбъект.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	Если ЭлементыОтбора.Количество() = 0 Тогда
		НовыйЭлемент = ЭлементыОтбора.Вставить(0, Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Клиенты");
		НовыйЭлемент.Использование = Ложь;
		
		НовыйЭлемент = ЭлементыОтбора.Вставить(1, Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СчетаДепо");
		НовыйЭлемент.Использование = Ложь;
		
		НовыйЭлемент = ЭлементыОтбора.Вставить(2, Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦенныеБумаги");
		НовыйЭлемент.Использование = Ложь;
		
		НовыйЭлемент = ЭлементыОтбора.Вставить(3, Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Эмитенты");
		НовыйЭлемент.Использование = Ложь;
	КонецЕсли;
	
	Для Каждого эл Из ЭлементыОтбора Цикл
		ЛевоеЗначение = СокрЛП(эл.ЛевоеЗначение);
		Если эл.Использование Тогда
			// Определим маску вида сравнения для запроса
			Если	эл.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				ИЛИ эл.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии
				ИЛИ эл.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
				ИЛИ эл.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
				МаскаУсловия = "В";
			ИначеЕсли эл.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
				ИЛИ эл.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии
				ИЛИ эл.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
				ИЛИ эл.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
				МаскаУсловия = "НЕ В";
			ИначеЕсли эл.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
				МаскаУсловия = "НЕ ЕСТЬ NULL";
			ИначеЕсли эл.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
				МаскаУсловия = "ЕСТЬ NULL";
			КонецЕсли;
			
			Если ЛевоеЗначение = "Клиенты" Тогда
				СравнениеКлиент = УсловиеСравнения(СравнениеКлиент, Запрос, МаскаУсловия, эл, "СчетДепо.Владелец",
					Справочники.Контрагенты.ПустаяСсылка(), "НеПроверятьКлиента", "Клиент");
			ИначеЕсли ЛевоеЗначение = "СчетаДепо" Тогда
				СравнениеСчетДепо = УсловиеСравнения(СравнениеСчетДепо, Запрос, МаскаУсловия, эл, "СчетДепо",
					Справочники.СчетаДепо.ПустаяСсылка(), "НеПроверятьСчетаДепо", "СчетДепо");
			ИначеЕсли ЛевоеЗначение = "ЦенныеБумаги" Тогда
				СравнениеЦБ = УсловиеСравнения(СравнениеЦБ, Запрос, МаскаУсловия, эл, "ЦБ",
					Справочники.ЦенныеБумаги.ПустаяСсылка(), "НеПроверятьЦБ", "ЦБ");
			ИначеЕсли ЛевоеЗначение = "Эмитенты" Тогда
				СравнениеЭмитент = УсловиеСравнения(СравнениеЭмитент, Запрос, МаскаУсловия, эл, "ЦБ.Эмитент",
					Справочники.Контрагенты.ПустаяСсылка(), "НеПроверятьЭмитента", "Эмитент");
			КонецЕсли;
		Иначе
			Если ЛевоеЗначение = "Клиенты" Тогда
				СравнениеКлиент	= СтрЗаменить(СравнениеКлиент, "ВидСравнения", "В");
				Запрос.УстановитьПараметр("Клиент",				СписокКлиентов);
				Запрос.УстановитьПараметр("НеПроверятьКлиента",	Истина);
			ИначеЕсли ЛевоеЗначение = "СчетаДепо" Тогда
				СравнениеСчетДепо	= СтрЗаменить(СравнениеСчетДепо, "ВидСравнения", "В");
				Запрос.УстановитьПараметр("СчетДепо",				СписокСчетовДепо);
				Запрос.УстановитьПараметр("НеПроверятьСчетаДепо",	Истина);
			ИначеЕсли ЛевоеЗначение = "ЦенныеБумаги" Тогда
				СравнениеЦБ	= СтрЗаменить(СравнениеЦБ, "ВидСравнения", "В");
				Запрос.УстановитьПараметр("ЦБ",				СписокЦБ);
				Запрос.УстановитьПараметр("НеПроверятьЦБ",	Истина);
			ИначеЕсли ЛевоеЗначение = "Эмитенты" Тогда
				СравнениеЭмитент	= СтрЗаменить(СравнениеЭмитент, "ВидСравнения", "В");
				Запрос.УстановитьПараметр("Эмитент",				СписокЭмитентов);
				Запрос.УстановитьПараметр("НеПроверятьЭмитента",	Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	УсловияОтбора = СравнениеКлиент + Символы.ПС
		+ " И " + СравнениеСчетДепо + Символы.ПС
		+ " И " + СравнениеЦБ + Символы.ПС
		+ " И " + СравнениеЭмитент + Символы.ПС
		+ " И (СчетДепоМХ.Владелец = &МХ		ИЛИ &НеПроверятьМХ)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УСЛОВИЯОТБОРА", УсловияОтбора);
	
КонецПроцедуры

Функция УсловиеСравнения(ТекстСравнения, Запрос, МаскаУсловия, эл, ИмяПоля, ПустаяСсылка, НеПроверятьПоле, ИмяПараметра)
	
	Если МаскаУсловия = "НЕ ЕСТЬ NULL" Тогда
		ТекстСравнения	= "(НЕ %ИмяПоля ЕСТЬ NULL
			| ИЛИ НЕ %ИмяПоля = НЕОПРЕДЕЛЕНО
			| ИЛИ НЕ %ИмяПоля = &%ПустаяСсылка
			| ИЛИ &%НеПроверятьПоле)";
		ТекстСравнения = СтрЗаменить(ТекстСравнения, "%ИмяПоля", ИмяПоля);
		ТекстСравнения = СтрЗаменить(ТекстСравнения, "%ПустаяСсылка", ИмяПараметра + "ПустаяСсылка");
		Запрос.УстановитьПараметр(ИмяПараметра+"ПустаяСсылка", ПустаяСсылка);
		ТекстСравнения = СтрЗаменить(ТекстСравнения, "%НеПроверятьПоле", НеПроверятьПоле);
	ИначеЕсли  МаскаУсловия = "ЕСТЬ NULL" Тогда
		ТекстСравнения	= "(%ИмяПоля ЕСТЬ NULL
			| ИЛИ %ИмяПоля = НЕОПРЕДЕЛЕНО
			| ИЛИ %ИмяПоля = &%ПустаяСсылка
			| ИЛИ &%НеПроверятьПоле)";
		ТекстСравнения = СтрЗаменить(ТекстСравнения, "%ИмяПоля", ИмяПоля);
		ТекстСравнения = СтрЗаменить(ТекстСравнения, "%ПустаяСсылка", ИмяПараметра + "ПустаяСсылка");
		Запрос.УстановитьПараметр(ИмяПараметра+"ПустаяСсылка", ПустаяСсылка);
		ТекстСравнения = СтрЗаменить(ТекстСравнения, "%НеПроверятьПоле", НеПроверятьПоле);
	Иначе
		ТекстСравнения = СтрЗаменить(ТекстСравнения, "ВидСравнения", МаскаУсловия);
	КонецЕсли;
	Запрос.УстановитьПараметр(ИмяПараметра, эл.ПравоеЗначение);
	Запрос.УстановитьПараметр(НеПроверятьПоле, Ложь);
	Возврат ТекстСравнения;
	
КонецФункции

Функция ВыборкаОперацийПоСчетамДепо() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
	Запрос.УстановитьПараметр("КонПериодаГраница", Новый Граница(КонецДня(КонПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("МХ", ?(МХПоУмолчанию, Константы.МестоХраненияПоУмолчанию.Получить(), МХОтбор));
	Запрос.УстановитьПараметр("НеПроверятьМХ", МХОтбор.Пустая() И Не МХПоУмолчанию);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиИОборотыЦБ.СчетДепо.Владелец КАК Клиент,
	|	ОстаткиИОборотыЦБ.СчетДепо КАК СчетДепо,
	|	ОстаткиИОборотыЦБ.СчетДепо.ВидСчетаДепо КАК ВидСчетаДепо,
	|	ОстаткиИОборотыЦБ.ЦБ КАК ЦБ,
	|	ОстаткиИОборотыЦБ.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиИОборотыЦБ.РазделСчетаДепоМХ КАК РазделСчета,
	|	ОстаткиИОборотыЦБ.СтатусЦБ КАК СтатусЦБ,
	|	ОстаткиИОборотыЦБ.СчетДепоМХ.Владелец КАК МХ,
	|	ОстаткиИОборотыЦБ.Регистратор КАК Регистратор,
	|	ОстаткиИОборотыЦБ.Регистратор.Дата КАК ДатаОперации,
	|	ОстаткиИОборотыЦБ.Регистратор.Номер КАК НомерПроводки,
	|	ОстаткиИОборотыЦБ.Регистратор.Основание КАК Основание,
	|	ВЫБОР
	|		КОГДА ОстаткиИОборотыЦБ.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|			ТОГДА ОстаткиИОборотыЦБ.Регистратор.ВидОперацииД
	|		КОГДА ОстаткиИОборотыЦБ.Регистратор ССЫЛКА Документ.ЦБВПути
	|			ТОГДА ОстаткиИОборотыЦБ.Регистратор.ВидОперацииД
	|		КОГДА ОстаткиИОборотыЦБ.Регистратор ССЫЛКА Документ.КонвертацияЦБ
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Конвертация)
	|		КОГДА ОстаткиИОборотыЦБ.Регистратор ССЫЛКА Документ.ПогашениеЦБ
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Погашение)
	|		КОГДА ОстаткиИОборотыЦБ.Регистратор ССЫЛКА Документ.ГлобальнаяОперация
	|			ТОГДА ОстаткиИОборотыЦБ.Регистратор.ВидГлобальнойОперации
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ПустаяСсылка)
	|	КОНЕЦ КАК ВидОперации,
	|	ЕСТЬNULL(ОстаткиИОборотыЦБ.КоличествоНачальныйОстаток, 0) КАК КоличествоНачальныйОстаток,
	|	ЕСТЬNULL(ОстаткиИОборотыЦБ.КоличествоКонечныйОстаток, 0) КАК КоличествоКонечныйОстаток,
	|	ЕСТЬNULL(ОстаткиИОборотыЦБ.КоличествоПриход, 0) КАК КоличествоПриход,
	|	ЕСТЬNULL(ОстаткиИОборотыЦБ.КоличествоРасход, 0) КАК КоличествоРасход,
	|	ЕСТЬNULL(НачЦБВПути.КоличествоОстаток, 0) КАК НачКоличествоВПути,
	|	ЕСТЬNULL(КонЦБВПути.КоличествоОстаток, 0) КАК КонКоличествоВПути
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.ОстаткиИОбороты(&НачПериода, &КонПериода, Регистратор, ДвиженияИГраницыПериода, &УСЛОВИЯОТБОРА) КАК ОстаткиИОборотыЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЦБВПути.Остатки(&НачПериода, &УСЛОВИЯОТБОРА) КАК НачЦБВПути
	|		ПО ОстаткиИОборотыЦБ.СчетДепоМХ.Владелец = НачЦБВПути.СчетДепоМХ.Владелец
	|			И ОстаткиИОборотыЦБ.ЦБ = НачЦБВПути.ЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЦБВПути.Остатки(&КонПериодаГраница, &УСЛОВИЯОТБОРА) КАК КонЦБВПути
	|		ПО ОстаткиИОборотыЦБ.ЦБ = КонЦБВПути.ЦБ
	|			И ОстаткиИОборотыЦБ.СчетДепоМХ.Владелец = КонЦБВПути.СчетДепоМХ.Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОперации,
	|	НомерПроводки
	|ИТОГИ
	|	СУММА(КоличествоНачальныйОстаток),
	|	СУММА(КоличествоКонечныйОстаток),
	|	СУММА(КоличествоПриход),
	|	СУММА(КоличествоРасход),
	|	МАКСИМУМ(НачКоличествоВПути),
	|	МАКСИМУМ(КонКоличествоВПути)
	|ПО
	|	Клиент,
	|	СчетДепо,
	|	ЦБ,
	|	РазделСчетаДепо,
	|	РазделСчета,
	|	СтатусЦБ";
	ЗаполнитьПараметрыЗапросаПоОтборуСКД(Запрос);
	Результат = Запрос.Выполнить();
	Возврат Результат;
	
КонецФункции

Процедура СформироватьОтчет(Результат) Экспорт
	
	Результат.Очистить();
	ДокументыКЭДО.Очистить();
	
	ТаблицаОтчетов = ПолучитьПечатныеФормы();
	
	Если ТаблицаОтчетов = Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Данные для формирования отчета не обнаружены.");
		Возврат;
	КонецЕсли;
	
	Результат.РазмерСтраницы		= "A4";
	Результат.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб			= Истина;
	
	// Обработаем полученные выписки, так же если стоит выгрузка в документооборот, то поместим выписки туда
	Для Каждого Строка Из ТаблицаОтчетов Цикл
		
		Если Справочники.Контрагенты.ОсобыеУсловия(Строка.Клиент) Тогда
			Если Не РегистрыСведений.ОтветственныеЛицаОрганизаций.ПользовательМожетРедактироватьОсобыеУсловия() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Особые условия: " + Строка.Клиент
					+ ". Выполнение операции доступно Ответственному за особых клиентов");
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Результат.Вывести(Строка.ТабличныйДокумент);
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
		// Помещаем отчет в Таблицу для ЭДО
		Если Документооборот Тогда
			
			// Проверим, что выписка еще не была выгружена в ЭДО
			Если ЗначениеЗаполнено(Строка.Основание)
				И Документы.СводныйОтчетОСовершенныхОперациях.БылОтправленВЭДО(Строка.Основание) Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Документ уже был помещен в ЭДО ранее: " + Строка.Основание;
				Сообщение.Сообщить();
				Продолжить;
			КонецЕсли;
			
			// Поместим таблицу для клиент серверной передачи
			АдресТаблицы  = ПоместитьВоВременноеХранилище(Строка.ТабличныйДокумент);
			
			НовыйДляЭДО	= ДокументыКЭДО.Добавить();
			
			НовыйДляЭДО.Клиент				= Строка.Клиент;
			НовыйДляЭДО.СчетДепо			= Строка.СчетДепо;
			НовыйДляЭДО.Документ			= Строка.Основание;
			НовыйДляЭДО.Основание			= Строка.Основание;
			НовыйДляЭДО.АдресТаблицы		= АдресТаблицы;
			НовыйДляЭДО.ActionType			= "INS";
		КонецЕсли;
	КонецЦикла;
	
	// Обработаем полученные выписки и поместим выписки в ЭДО если установлен соответствующий флаг
	Если Документооборот Тогда
		ПоместитьОтчетыВЭдо();
	КонецЕсли;
	
КонецПроцедуры

// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off

Функция ПолучитьПечатныеФормы() Экспорт
	
	// Создадим таблицу для хранения печатных форм
	ТаблицаПечатныхФорм	= Новый ТаблицаЗначений;
	ТаблицаПечатныхФорм.Колонки.Добавить("Клиент");
	ТаблицаПечатныхФорм.Колонки.Добавить("СчетДепо");
	ТаблицаПечатныхФорм.Колонки.Добавить("Основание");
	ТаблицаПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	
	// Получим данные для отчета
	РезультатЗапроса = ВыборкаОперацийПоСчетамДепо();
	
	Если РезультатЗапроса.Пустой() Тогда
		стАктивныеОтборы = ПолучитьАктивныеОтборы();
		Если стАктивныеОтборы.Свойство("Клиенты") И ТипЗнч(стАктивныеОтборы.Клиенты) = Тип("СправочникСсылка.Контрагенты") Тогда
			// т.к. установлен отбор по клиенту, то получение и заполнение макета можно выполнить без учета результата запроса по остаткам и оборотам
			Клиент = стАктивныеОтборы.Клиенты;
			
			СписокСчетовДепо = Новый СписокЗначений;
			Если стАктивныеОтборы.Свойство("СчетаДепо") Тогда
				Если ТипЗнч(стАктивныеОтборы.СчетаДепо) = Тип("СписокЗначений") Тогда
					СписокСчетовДепо = стАктивныеОтборы.СчетаДепо;
				ИначеЕсли ТипЗнч(стАктивныеОтборы.СчетаДепо) = Тип("СправочникСсылка.СчетаДепо") Тогда
					СписокСчетовДепо.Добавить(стАктивныеОтборы.СчетаДепо);
				Иначе
					СписокСчетовДепо.Добавить(Справочники.СчетаДепо.ПустаяСсылка());
				КонецЕсли;
			Иначе
				СписокСчетовДепо.Добавить(Справочники.СчетаДепо.ПустаяСсылка());
			КонецЕсли;
			
			Для Каждого СчетДепоОтбора Из СписокСчетовДепо Цикл
				НовыйПечатныйДокумент					= ТаблицаПечатныхФорм.Добавить();
				НовыйПечатныйДокумент.Клиент			= Клиент;
				НовыйПечатныйДокумент.СчетДепо			= СчетДепоОтбора.Значение;
				НовыйПечатныйДокумент.Основание			= ВыпискаДокумент;
				НовыйПечатныйДокумент.ТабличныйДокумент	= ПолучитьПустойМакет(Клиент, СчетДепоОтбора.Значение);
			КонецЦикла;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если Выписка И ЗначениеЗаполнено(ВыпискаДокумент) Тогда
		Основание = ВыпискаДокумент;
	Иначе
		Основание = Документы.Выписка.ПустаяСсылка();
	КонецЕсли;
	
	ПоГруппировке	= ОбходРезультатаЗапроса.ПоГруппировкамСИерархией;
	ВыборкаКлиенты	= РезультатЗапроса.Выбрать(ПоГруппировке);
	Пока ВыборкаКлиенты.Следующий() Цикл
		
		Клиент = ВыборкаКлиенты.Клиент;
		
		// Очистим таблицу остатков под нового клиента
		ТаблицаЗначенийОстаткиНаКонец.Очистить();
		
		ИмяМакета = ПолучитьИмяМакета(Клиент, Основание.Дата);
		Макет = ПолучитьМакет(ИмяМакета);
		
		ВыборкаСчетаДепо = ВыборкаКлиенты.Выбрать(ПоГруппировке);
		Пока ВыборкаСчетаДепо.Следующий() Цикл
			
			ТабличныйДокумент = Новый ТабличныйДокумент;
			
			ТабличныйДокумент.РазмерСтраницы		= "A4";
			ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
			ТабличныйДокумент.АвтоМасштаб			= Истина;
			ТабличныйДокумент.ТолькоПросмотр		= Истина;
			
			ПараметрыПереносаСтраницы = Новый Структура;
			
			СчетДепо = ВыборкаСчетаДепо.СчетДепо;
			ВидСчетаДепо = ВыборкаСчетаДепо.ВидСчетаДепо;
			
			ОпределяющаяДата = ?(ЗначениеЗаполнено(Основание.Дата), Основание.Дата, КонПериода);
			
			ИмяСекции = "Подвал";
			Подвал = Макет.ПолучитьОбласть(ИмяСекции);
			ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(Подвал.Параметры, ИмяМакета, ИмяСекции,
				мТекстыЗаголовков, ВидСчетаДепо);
			Подвал.Параметры.Заполнить(СформироватьПараметрыПодвалаМакета(Клиент, СчетДепо));
			
			ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
			Если Не ЗначениеЗаполнено(ТекПользователь) Или Не РольДоступна("ПравоПодписанияОтчетов") Тогда // BSLLS:IsInRoleMethod-off
				Отбор = Новый Структура;
				Отбор.Вставить("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.ПодписантОтчетовПоУмолчанию);
				ОтветственноеЛицо = РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьПоследнее(ОпределяющаяДата, Отбор).ФизическоеЛицо;
			Иначе
				ОтветственноеЛицо = ТекПользователь.ФизЛицо;
			КонецЕсли;
			
			Если ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") И ВыводитьФаксимилеВОтчетах И Не Документооборот Тогда
				ФормированиеПечатныхФорм.ПолучитьФаксимилье(ОтветственноеЛицо, Подвал.Рисунки.Faksimilie.Картинка);
			Иначе
				Подвал.Рисунки.Faksimilie.Картинка	= Новый Картинка;
			КонецЕсли;
			
			ИмяСекции = "Заголовок";
			Область = Макет.ПолучитьОбласть(ИмяСекции);
			Область.Параметры.Заполнить(СформироватьПараметрыЗаголовкаМакета(Клиент, СчетДепо));
			ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(Область.Параметры, ИмяМакета, ИмяСекции,
				мТекстыЗаголовков, ВидСчетаДепо);
			ТабличныйДокумент.Вывести(Область);
			
			ИмяСекции = "ШапкаОстатки";
			ШапкаОстатки = Макет.ПолучитьОбласть(ИмяСекции);
			ШапкаОстатки.Параметры.Заполнить(СформироватьПараметрыШапкиМакета(Клиент, НачПериода));
			ШапкаОстатки.Параметры.МоментДня = "начало операционного дня";
			ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ШапкаОстатки.Параметры, ИмяМакета, ИмяСекции,
				мТекстыЗаголовков, ВидСчетаДепо);
			ТабличныйДокумент.Вывести(ШапкаОстатки);
			
			флВыведенаСтрокаОстатков = Ложь;
			СтрокаОстатки = Макет.ПолучитьОбласть("СтрокаОстатки");
			
			ВыборкаЦБ = ВыборкаСчетаДепо.Выбрать(ПоГруппировке);
			Пока ВыборкаЦБ.Следующий() Цикл
				ВыборкаРазделСчетаДепо = ВыборкаЦБ.Выбрать(ПоГруппировке);
				Пока ВыборкаРазделСчетаДепо.Следующий() Цикл
					ВыборкаРазделСчетаДепоМХ = ВыборкаРазделСчетаДепо.Выбрать(ПоГруппировке);
					Пока ВыборкаРазделСчетаДепоМХ.Следующий() Цикл
						ЗаполнитьСекциюСтрокаОстатки(СтрокаОстатки, ВыборкаРазделСчетаДепоМХ, Клиент.ОтчетыНаАнглийскомЯзыке, ПоГруппировке);
						ВывестиСекциюСтрокаОстаткиНаНачало(ТабличныйДокумент, СтрокаОстатки, флВыведенаСтрокаОстатков);
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			
			Если Не флВыведенаСтрокаОстатков Тогда
				ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ПустаяСтрокаОстатки"));
			КонецЕсли;
			
			ИмяСекции = "ШапкаОборот";
			ШапкаОборот = Макет.ПолучитьОбласть(ИмяСекции);
			ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ШапкаОборот.Параметры, ИмяМакета, ИмяСекции, мТекстыЗаголовков, ВидСчетаДепо);
			ТабличныйДокумент.Вывести(ШапкаОборот);
			
			СтрокаОборот = Макет.ПолучитьОбласть("СтрокаОборот");
			ВывестиСекциюСтрокаОборот(ТабличныйДокумент, СтрокаОборот, Клиент.ОтчетыНаАнглийскомЯзыке, ВидСчетаДепо);
			
			ШапкаОстатки.Параметры.Заполнить(СформироватьПараметрыШапкиМакета(Клиент, КонПериода));
			ШапкаОстатки.Параметры.МоментДня = "конец операционного дня";
			
			ПараметрыПереносаСтраницы.Вставить("ШапкаОстатки", ШапкаОстатки);
			ПараметрыПереносаСтраницы.Вставить("Подвал", Подвал);
			
			ВывестиСекциюСтрокаОстаткиНаКонец(ТабличныйДокумент, СтрокаОстатки, Клиент.ОтчетыНаАнглийскомЯзыке, ПараметрыПереносаСтраницы);
			
			ТабличныйДокумент.Вывести(Подвал);
			
			ТабличныйДокумент.НижнийКолонтитул.Выводить = Истина;
			ТабличныйДокумент.НижнийКолонтитул.ТекстВЦентре = "[&НомерСтраницы] из [&СтраницВсего]";
			
			// Добавим Табличный документ в список сформированных
			НовыйПечатныйДокумент = ТаблицаПечатныхФорм.Добавить();
			НовыйПечатныйДокумент.Клиент			= Клиент;
			НовыйПечатныйДокумент.СчетДепо			= СчетДепо;
			НовыйПечатныйДокумент.Основание			= Основание;
			НовыйПечатныйДокумент.ТабличныйДокумент	= ТабличныйДокумент;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаПечатныхФорм;
	
КонецФункции

// BSLLS:CognitiveComplexity-on
// BSLLS:CyclomaticComplexity-on

Процедура ЗаполнитьСекциюСтрокаОстатки(СтрокаОстатки, ВыборкаМХ, ОтчетыНаАнглийскомЯзыке, ПоГруппировке)
	
	СтрокаОстатки.Параметры.КолОбр		= 0;
	СтрокаОстатки.Параметры.КолНеОбр	= 0;
	
	СтрокаОстатки.Параметры.ЦБ = ОбщегоНазначенияКлиентСервер.ПредставлениеЦБ(ВыборкаМХ.ЦБ, ОтчетыНаАнглийскомЯзыке);
	СтрокаОстатки.Параметры.ГосНомер = Строка(ВыборкаМХ.ЦБ.НомерРегистрации);
	Попытка
		СтрокаОстатки.Параметры.ISIN = Строка(ВыборкаМХ.ЦБ.ISIN);
	Исключение
	КонецПопытки;
	СтрокаОстатки.Параметры.МХ = ВыборкаМХ.РазделСчета.Владелец.Владелец.КодМестаХранения;
	ПредставлениеРСД = ОбщегоНазначенияКлиентСервер.ПредставлениеРазделаСчетаДепо(ВыборкаМХ.РазделСчетаДепо, ОтчетыНаАнглийскомЯзыке);
	СтрокаОстатки.Параметры.РС = ПредставлениеРСД;
	
	НоваяСтрокаОстКон = ТаблицаЗначенийОстаткиНаКонец.Добавить();
	ПредставлениеРСД = ОбщегоНазначенияКлиентСервер.ПредставлениеРазделаСчетаДепо(ВыборкаМХ.РазделСчетаДепо, ОтчетыНаАнглийскомЯзыке);
	НоваяСтрокаОстКон.РазделСчетаДепо = ПредставлениеРСД;
	НоваяСтрокаОстКон.ЦБ		= ВыборкаМХ.ЦБ;
	НоваяСтрокаОстКон.ГосНомер	= ВыборкаМХ.ЦБ.НомерРегистрации;
	НоваяСтрокаОстКон.МХ		= ВыборкаМХ.РазделСчета.Владелец.Владелец.КодМестаХранения;
	НоваяСтрокаОстКон.КолОбр	= 0;
	
	КолОбрОстНач		= 0;
	ВыборкаСтатусыЦБ	= ВыборкаМХ.Выбрать(ПоГруппировке);
	Пока ВыборкаСтатусыЦБ.Следующий() Цикл
		ВеткаСвободных		= (ВыборкаСтатусыЦБ.СтатусЦБ = Перечисления.СтатусыЦБ.Свободна);
		ВеткаОбремененных	= (ВыборкаСтатусыЦБ.СтатусЦБ = Перечисления.СтатусыЦБ.Обременена);
		ВеткаБлок			= (ВыборкаСтатусыЦБ.СтатусЦБ = Перечисления.СтатусыЦБ.Блокирована);
		ВеткаЗалог			= (ВыборкаСтатусыЦБ.СтатусЦБ = Перечисления.СтатусыЦБ.Заложена);
	
		ВыборкаСтрокОпераций = ВыборкаСтатусыЦБ.Выбрать();
		
		Если ВеткаСвободных Тогда
			СтрокаОстатки.Параметры.КолНеОбр = ВыборкаСтатусыЦБ.КоличествоНачальныйОстаток;
			НоваяСтрокаОстКон.КолНеОбр		 = ВыборкаСтатусыЦБ.КоличествоКонечныйОстаток;
			ЗаполнитьОборотПоСчетуДепо(ВыборкаСтрокОпераций);
		
		ИначеЕсли ВеткаОбремененных ИЛИ ВеткаБлок Тогда
			КолОбрОстНач				= КолОбрОстНач + ВыборкаСтатусыЦБ.КоличествоНачальныйОстаток;
			НоваяСтрокаОстКон.КолОбр	= НоваяСтрокаОстКон.КолОбр + ВыборкаСтатусыЦБ.КоличествоКонечныйОстаток;
			ЗаполнитьОборотПоСчетуДепо(ВыборкаСтрокОпераций);
		ИначеЕсли ВеткаЗалог Тогда
			КолОбрОстНач				= КолОбрОстНач + ВыборкаСтатусыЦБ.КоличествоНачальныйОстаток;
			НоваяСтрокаОстКон.КолОбр 	= НоваяСтрокаОстКон.КолОбр + ВыборкаСтатусыЦБ.КоличествоКонечныйОстаток;
			НоваяСтрокаОстКон.КолЗалог	= ВыборкаСтатусыЦБ.КоличествоКонечныйОстаток;
			ЗаполнитьОборотПоСчетуДепо(ВыборкаСтрокОпераций);
		КонецЕсли;
		
		СтрокаОстатки.Параметры.КолОбр = КолОбрОстНач;
		НоваяСтрокаОстКон.КолВПути = ВыборкаМХ.КонКоличествоВПути;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиСекциюСтрокаОстаткиНаНачало(ТабличныйДокумент, СтрокаОстатки, флВыведенаСтрокаОстатков)
	
	Если СтрокаОстатки.Параметры.КолОбр <> 0 ИЛИ СтрокаОстатки.Параметры.КолНеОбр <> 0 Тогда
		ТабличныйДокумент.Вывести(СтрокаОстатки);
		флВыведенаСтрокаОстатков = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиСекциюСтрокаОборот(ТабличныйДокумент, СтрокаОборот, ОтчетыНаАнглийскомЯзыке, ВидСчетаДепо)
	
	ТаблицаЗначенийОперации.Сортировать("ДатаВремя,НомерПроводки");
	Для Каждого ТекущаяСтрока Из ТаблицаЗначенийОперации Цикл 
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Регистратор) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОборот.Параметры.ДатаВремя = ТекущаяСтрока.ДатаВремя;
		ПредставлениеРСД = ОбщегоНазначенияКлиентСервер.ПредставлениеРазделаСчетаДепо(ТекущаяСтрока.РазделСчетаДепо, ОтчетыНаАнглийскомЯзыке);
		СтрокаОборот.Параметры.РС = ПредставлениеРСД;
		
		Если ТекущаяСтрока.ВидОперации = Справочники.ВидыОпераций.Депонирование Тогда
			Опер = "Зачисление";
			Если ОтчетыНаАнглийскомЯзыке Тогда
				Опер = Опер + " / Entry";
			КонецЕсли;
		ИначеЕсли ТекущаяСтрока.ВидОперации = Справочники.ВидыОпераций.СнятиеСДепонирования Тогда
			Опер = "Списание";
			Если ОтчетыНаАнглийскомЯзыке Тогда
				Опер = Опер + " / Withdrawal";
			КонецЕсли;
		Иначе
			Если ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетНФИ И ЗначениеЗаполнено(ТекущаяСтрока.ВидОперации.НаименованиеОперацииИФИ) Тогда
				Опер = СокрЛП(ТекущаяСтрока.ВидОперации.НаименованиеОперацииИФИ); 
			Иначе
				Опер = СокрЛП(ТекущаяСтрока.ВидОперации.Наименование);
			КонецЕсли;
			Если ОтчетыНаАнглийскомЯзыке И ЗначениеЗаполнено(ТекущаяСтрока.ВидОперации.АнглийскоеНаименование) Тогда
				Опер = Опер + " / " + СокрЛП(ТекущаяСтрока.ВидОперации.АнглийскоеНаименование);
			КонецЕсли;
		КонецЕсли;
		
		СтрокаОборот.Параметры.НаименованиеОпер = Опер;
		СтрокаОборот.Параметры.ЦеннаяБумага		= ОбщегоНазначенияКлиентСервер.ПредставлениеЦБ(ТекущаяСтрока.ЦБ,
			ОтчетыНаАнглийскомЯзыке);
		СтрокаОборот.Параметры.РегНомер			= ТекущаяСтрока.ЦБ.НомерРегистрации;
		
		Попытка
			СтрокаОборот.Параметры.ISIN = ТекущаяСтрока.ЦБ.ISIN;
		Исключение
		КонецПопытки;
		
		СтрокаОборот.Параметры.КолЗач			= ТекущаяСтрока.Зачислено;
		СтрокаОборот.Параметры.КолСпис			= ТекущаяСтрока.Списано;
		
		Регистратор = ТекущаяСтрока.Регистратор;
		ДокументОснование = "";
		Если Метаданные.Документы.Найти(Регистратор.Метаданные().Имя).Реквизиты.Найти("ДокументОснование") <> Неопределено
			И ЗначениеЗаполнено(Регистратор.ДокументОснование) Тогда
			
			ДокументОснование = СокрЛП(Регистратор.ДокументОснование.Метаданные().Синоним);
			Если ОтчетыНаАнглийскомЯзыке Тогда
				ДокументОснование = ДокументОснование + "["
					+ ОбщегоНазначенияКлиентСервер.ПредставлениеДокумента(
						Регистратор.ДокументОснование, Истина) + "]";
			КонецЕсли;
					
			ДокументОснование = ДокументОснование + " № "
				+ СокрЛП(Регистратор.ДокументОснование.Номер)
				+ ?(ОтчетыНаАнглийскомЯзыке, " от[dated] ", " от ")
				+ Формат(Регистратор.ДокументОснование.Дата,"ДФ=dd.MM.yy");
		КонецЕсли;
		СтрокаОборот.Параметры.Основание = ДокументОснование;
		ТабличныйДокумент.Вывести(СтрокаОборот);
	КонецЦикла;
	
КонецПроцедуры

// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off

Процедура ВывестиСекциюСтрокаОстаткиНаКонец(ТабличныйДокумент, СтрокаОстатки, ОтчетыНаАнглийскомЯзыке, ПараметрыПереносаСтраницы)
	
	ОбластиКПроверке = Новый Массив;
	ЕдинственнаяСтрока = Ложь;
	Если ТаблицаЗначенийОстаткиНаКонец.Количество() = 0 Тогда
		ОбластиКПроверке.Добавить(ПараметрыПереносаСтраницы.ШапкаОстатки);
		ОбластиКПроверке.Добавить(ПараметрыПереносаСтраницы.Подвал);
		ФормированиеПечатныхФорм.ВывестиГоризонтальныйРазделитель(ТабличныйДокумент, ОбластиКПроверке);
		ТабличныйДокумент.Вывести(ПараметрыПереносаСтраницы.ШапкаОстатки);
	ИначеЕсли ТаблицаЗначенийОстаткиНаКонец.Количество() = 1 Тогда
		ЕдинственнаяСтрока = Истина;
	Иначе
		ТабличныйДокумент.Вывести(ПараметрыПереносаСтраницы.ШапкаОстатки);
	КонецЕсли;
	
	НомерПоследнейСтроки = 0;
	НомерТекущейСтроки = 0;
	Для Каждого ТекущаяСтрока Из ТаблицаЗначенийОстаткиНаКонец Цикл
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
		Если ТекущаяСтрока.КолНеОбр = Неопределено Тогда
			ТекущаяСтрока.КолНеОбр = 0;
		КонецЕсли;
		Если ТекущаяСтрока.КолЗалог = Неопределено Тогда
			ТекущаяСтрока.КолЗалог = 0;
		КонецЕсли;
		Если ТекущаяСтрока.КолОбр = Неопределено Тогда
			ТекущаяСтрока.КолОбр = 0;
		КонецЕсли;
		Если ТекущаяСтрока.КолВПути = Неопределено Тогда
			ТекущаяСтрока.КолВПути = 0;
		КонецЕсли;
		
		ЭтоСтрокаСИтогами = ТекущаяСтрока.КолНеОбр <> 0 Или ТекущаяСтрока.КолОбр <> 0;
		Если ЭтоСтрокаСИтогами Тогда
			НомерПоследнейСтроки = НомерТекущейСтроки;
		КонецЕсли;
	КонецЦикла;
	
	НомерТекущейСтроки = 0;
	Для Каждого ТекущаяСтрока Из ТаблицаЗначенийОстаткиНаКонец Цикл
		НомерТекущейСтроки = НомерТекущейСтроки + 1;
		ЭтоПоследняяСтрока = НомерТекущейСтроки = НомерПоследнейСтроки;
		
		ЭтоСтрокаСИтогами = ТекущаяСтрока.КолНеОбр <> 0 Или ТекущаяСтрока.КолОбр <> 0;
		
		Если ЭтоСтрокаСИтогами Тогда
			
			ПредставлениеРСД = ТекущаяСтрока.РазделСчетаДепо;
			СтрокаОстатки.Параметры.РС = ПредставлениеРСД;
			
			СтрокаОстатки.Параметры.ЦБ = ОбщегоНазначенияКлиентСервер.ПредставлениеЦБ(ТекущаяСтрока.ЦБ, ОтчетыНаАнглийскомЯзыке);
			Если МХПоУмолчанию Тогда
				СтрокаОстатки.Параметры.МХ = МХОтбор;
			Иначе
				СтрокаОстатки.Параметры.МХ = ТекущаяСтрока.МХ;
			КонецЕсли;
			СтрокаОстатки.Параметры.КолНеОбр	= ТекущаяСтрока.КолНеОбр;
			СтрокаОстатки.Параметры.КолОбр		= ТекущаяСтрока.КолОбр;
			
			СтрокаОстатки.Параметры.ГосНомер = ТекущаяСтрока.ГосНомер;
			Попытка
				СтрокаОстатки.Параметры.ISIN = ТекущаяСтрока.ЦБ.ISIN;
			Исключение
			КонецПопытки;
			
			Если ЭтоПоследняяСтрока Тогда
				Если ЕдинственнаяСтрока Тогда
					ОбластиКПроверке.Добавить(ПараметрыПереносаСтраницы.ШапкаОстатки);
				КонецЕсли;
				ОбластиКПроверке.Добавить(СтрокаОстатки);
				ОбластиКПроверке.Добавить(ПараметрыПереносаСтраницы.Подвал);
				ФормированиеПечатныхФорм.ВывестиГоризонтальныйРазделитель(ТабличныйДокумент, ОбластиКПроверке);
				Если ЕдинственнаяСтрока Тогда
					ТабличныйДокумент.Вывести(ПараметрыПереносаСтраницы.ШапкаОстатки);
				КонецЕсли;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(СтрокаОстатки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// BSLLS:CognitiveComplexity-on
// BSLLS:CyclomaticComplexity-on

Функция ПолучитьПустойМакет(Контрагент, СчетДЕПО)
	
	Если Выписка И ЗначениеЗаполнено(ВыпискаДокумент) Тогда
		Основание = ВыпискаДокумент;
	Иначе
		Основание = Документы.Выписка.ПустаяСсылка();
	КонецЕсли;
	
	ИмяМакета	= ПолучитьИмяМакета(Контрагент, Основание.Дата);
	Макет		= ПолучитьМакет(ИмяМакета);
	ТабДок		= Новый ТабличныйДокумент;
	
	ИмяСекции = "Заголовок";	
	ОбластьЗаголовок = Макет.ПолучитьОбласть(ИмяСекции);
	ОбластьЗаголовок.Параметры.Заполнить(СформироватьПараметрыЗаголовкаМакета(Контрагент, СчетДЕПО));
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ОбластьЗаголовок.Параметры, ИмяМакета, ИмяСекции,
		мТекстыЗаголовков, СчетДепо.ВидСчетаДепо);
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ИмяСекции = "ШапкаОстатки";	
	ОбластьШапкаОстатки = Макет.ПолучитьОбласть(ИмяСекции);
	ОбластьШапкаОстатки.Параметры.Заполнить(СформироватьПараметрыШапкиМакета(Контрагент, НачПериода));
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ОбластьШапкаОстатки.Параметры, ИмяМакета, ИмяСекции,
		мТекстыЗаголовков, СчетДепо.ВидСчетаДепо);
	ТабДок.Вывести(ОбластьШапкаОстатки);
	ТабДок.Вывести(Макет.ПолучитьОбласть("ПустаяСтрокаОстатки"));
	
	ИмяСекции = "ШапкаОборот";
	ШапкаОборот = Макет.ПолучитьОбласть(ИмяСекции);
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ШапкаОборот.Параметры, ИмяМакета, ИмяСекции,
		мТекстыЗаголовков, СчетДепо.ВидСчетаДепо);
	ТабДок.Вывести(ШапкаОборот);
	
	ТабДок.Вывести(Макет.ПолучитьОбласть("ПустаяСтрокаОборот"));
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОбластьШапкаОстатки.Параметры.Заполнить(СформироватьПараметрыШапкиМакета(Контрагент, КонПериода));
	ТабДок.Вывести(ОбластьШапкаОстатки);
	ТабДок.Вывести(Макет.ПолучитьОбласть("ПустаяСтрокаОстатки"));

	ИмяСекции = "Подвал";
	ОбластьПодвал = Макет.ПолучитьОбласть(ИмяСекции);
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ОбластьПодвал.Параметры, ИмяМакета, ИмяСекции,
		мТекстыЗаголовков, СчетДепо.ВидСчетаДепо);
	ОбластьПодвал.Параметры.Заполнить(СформироватьПараметрыПодвалаМакета(Контрагент, СчетДепо));
	
	// Получить факсимилье
	ОтветственноеЛицо = ПараметрыСеанса.ТекущийПользователь;
	
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") И ВыводитьФаксимилеВОтчетах И Не Документооборот Тогда
		ФормированиеПечатныхФорм.ПолучитьФаксимилье(ОтветственноеЛицо.ФизЛицо, ОбластьПодвал.Рисунки.Faksimilie.Картинка);
	Иначе
		ОбластьПодвал.Рисунки.Faksimilie.Картинка	= Новый Картинка;
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.РазмерСтраницы	  = "A4";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб		  = Истина;
	ТабДок.ТолькоПросмотр	  = Истина;

	Возврат ТабДок;
	
КонецФункции

Процедура ЗаполнитьОборотПоСчетуДепо(Данные);
	
	Пока Данные.Следующий() Цикл
		НоваяСтрокаОперация					= ТаблицаЗначенийОперации.Добавить();
		НоваяСтрокаОперация.ДатаВремя		= Данные.ДатаОперации;
		НоваяСтрокаОперация.НомерПроводки	= Данные.НомерПроводки;
		НоваяСтрокаОперация.ВидОперации		= Данные.ВидОперации;
		НоваяСтрокаОперация.ЦБ				= Данные.ЦБ;
		НоваяСтрокаОперация.ВидВыпускЦБ		= Строка(Данные.ЦБ.ТипЦБ) + " " + Строка(Данные.ЦБ.ВидЦБ) + ", " + Строка(Данные.ЦБ.Выпуск);
		НоваяСтрокаОперация.Зачислено		= Данные.КоличествоПриход;
		НоваяСтрокаОперация.Списано			= Данные.КоличествоРасход;
		НоваяСтрокаОперация.Основание		= Данные.Основание;
		НоваяСтрокаОперация.Регистратор		= Данные.Регистратор;
		НоваяСтрокаОперация.РазделСчета		= Данные.РазделСчета;
		НоваяСтрокаОперация.РазделСчетаДепо	= Данные.РазделСчетаДепо;
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьПараметрыЗаголовкаМакета(Контрагент, СчетДЕПО)

	стПараметры = Новый Структура;
	
	Период				= ?(ЗначениеЗаполнено(ВыпискаДокумент), ВыпискаДокумент.Дата, КонПериода);
	ПериодСтрокой		= Формат(Период, "ДФ=ddMMyyyy");
	Депозитарий			= Константы.ОрганизацияПоУмолчанию.Получить();
	ДанныеЛицензии		= ФормированиеПечатныхФорм.ДанныеЛицензииОрганизации(Константы.ОрганизацияПоУмолчанию.Получить());
	
	стПараметры.Вставить("Дата", "с " + Формат(НачПериода,"ДЛФ=DD") + " по " + Формат(КонПериода,"ДЛФ=DD"));
	стПараметры.Вставить("ТипОперации", "Формирование отчета по операциям за период по счету ДЕПО");
	стПараметры.Вставить("ИсходящийНомер", СокрЛП(ВыпискаДокумент.Номер));
	стПараметры.Вставить("Депозитарий", "ДЕПОЗИТАРИЙ"+ Символы.ПС + СокрЛП(Депозитарий.Наименование));
	стПараметры.Вставить("Лицензия", "Лицензия № " + СокрЛП(ДанныеЛицензии.НомерЛицензии));
	стПараметры.Вставить("ЛицензияДата", "выдана " + Формат(ДанныеЛицензии.ДатаЛицензии, "ДФ=dd.MM.yyyy") + " г. ФСФР России");
	стПараметры.Вставить("Custody", "");
	
	Если Контрагент.ОтчетыНаАнглийскомЯзыке Тогда
		стПараметры.Депозитарий = стПараметры.Депозитарий + Символы.ПС + стПараметры.Лицензия + Символы.ПС + стПараметры.ЛицензияДата;
		стПараметры.Custody = "CUSTODY" + Символы.ПС + СокрЛП(Депозитарий.АнглийскоеНаименование) + Символы.ПС + "License No. " + СокрЛП(ДанныеЛицензии.НомерЛицензии)
			+ Символы.ПС + "issued by FFMS of Russia on " + Формат(ДанныеЛицензии.ДатаЛицензии, "ДЛФ=D");
		
		Для сч = 1 По 12 Цикл
			стПараметры.Вставить("ор"+сч, Сред(стПараметры.ИсходящийНомер, сч, 1));
		КонецЦикла;
	КонецЕсли;
	
	стПараметры.Вставить("НомерВыписки", "Отчет № " + стПараметры.ИсходящийНомер + " об операциях по счету ДЕПО");
	Если Период < Дата(2016, 6, 14) Тогда
		стПараметры.НомерВыписки = "Выписка № " + стПараметры.ИсходящийНомер + " по операциям по счету ДЕПО";
	КонецЕсли;	
	
	стПараметры.Вставить("ИнициаторОперации", "");
	Если ЗначениеЗаполнено(ВыпискаДокумент) И ЗначениеЗаполнено(ВыпискаДокумент.ДокументОснование) Тогда
		стПараметры.ИнициаторОперации = ОбщегоНазначенияКлиентСервер.НаименованиеКлиента(ВыпискаДокумент.ДокументОснование.Инициатор, Контрагент.ОтчетыНаАнглийскомЯзыке);
	КонецЕсли;

	стПараметры.Вставить("НаименованиеДепонента", ОбщегоНазначенияКлиентСервер.НаименованиеЮрФизЛицаКлиента(Контрагент, Период, Контрагент.ОтчетыНаАнглийскомЯзыке));
	стПараметры.Вставить("ДокументыДепонента", ОбщегоНазначенияКлиентСервер.ДокументКлиента(Контрагент, Период));
	стПараметры.Вставить("НаименованиеСчетаДЕПО", ОбщегоНазначенияКлиентСервер.НаименованиеКлиента(Контрагент, Контрагент.ОтчетыНаАнглийскомЯзыке));
	стПараметры.Вставить("НомерСчетаДЕПО", ?(ЗначениеЗаполнено(СчетДЕПО), СокрЛП(СчетДЕПО.Код), ""));

	ФормированиеПечатныхФорм.СформироватьДатуДДММГГ(стПараметры, "", Период);
	ФормированиеПечатныхФорм.СформироватьДатуДДММГГ(стПараметры, "С", НачПериода);
	ФормированиеПечатныхФорм.СформироватьДатуДДММГГ(стПараметры, "По", КонПериода);
	
	Инфо = ФормированиеПечатныхФорм.ИнформацияОДепозитарии(Период, СчетДЕПО.ВидСчетаДепо)
		+ Символы.ПС + Символы.ПС + ФормированиеПечатныхФорм.ИнформацияОДепозитарииНаАнглийском(Период, СчетДЕПО.ВидСчетаДепо);
	стПараметры.Вставить("ИнформацияОДепозитарии", Инфо);
	
	стПараметры.Вставить("ТипОперации", ТипОперации(СчетДЕПО.ВидСчетаДепо, "Русский"));
	Если Контрагент.ОтчетыНаАнглийскомЯзыке Тогда
		стПараметры.Вставить("ТипОперацииНаАнглийском", ТипОперации(СчетДЕПО.ВидСчетаДепо, "Английский"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетДЕПО) Тогда
		Если РегистрыСведений.КлиентыСУчетомНаСчетахТипаC.ЦБКлиентаУчитываютсяНаСчетеТипаС(Период, СчетДЕПО.Владелец) Тогда
			ТипСчетаДепо = "" + СчетДЕПО.ТипСчетаДепо + " типа С";
		Иначе
			ТипСчетаДепо = СчетДЕПО.ТипСчетаДепо;
		КонецЕсли;
		НаименованиеСчетаДЕПО =
			?(Контрагент.ОтчетыНаАнглийскомЯзыке,
				ПереводТекстаНаДругиеЯзыки.ДополнитьТекстПереводом(ТипСчетаДепо), СокрЛП(ТипСчетаДепо));
	Иначе
		НаименованиеСчетаДЕПО = "";
	КонецЕсли;
	стПараметры.Вставить("НаименованиеСчетаДЕПО", НаименованиеСчетаДЕПО);
	
	Возврат стПараметры;
	
КонецФункции

Функция ТипОперации(ВидСчетаДепо, Язык)
	
	Тип = "";
	Если Язык = "Русский" Тогда
		Тип = "Формирование выписки по операциям за период по счету ДЕПО";
	ИначеЕсли Язык = "Английский" Тогда
		Тип = "Generation of custody account transactions statement for a period";
	КонецЕсли;
	Возврат Тип;
	
КонецФункции

Функция СформироватьПараметрыШапкиМакета(Контрагент, Период)

	стПараметры = Новый Структура;
	стПараметры.Вставить("ДатаОстатков", Формат(Период, "ДЛФ=DD"));
	
	ФормированиеПечатныхФорм.СформироватьДатуДДММГГ(стПараметры, "На", Период);
	
	Возврат стПараметры;
	
КонецФункции

Функция СформироватьПараметрыПодвалаМакета(Контрагент, СчетДепо)
	
	стПараметры = Новый Структура;
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если НЕ ЗначениеЗаполнено(ТекПользователь) ИЛИ НЕ РольДоступна("ПравоПодписанияОтчетов") Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ОтветственноеЛицо",Перечисления.ОтветственныеЛицаОрганизаций.ПодписантОтчетовПоУмолчанию);
		ОтветственноеЛицо = РегистрыСведений.ОтветственныеЛицаОрганизаций.ПолучитьПоследнее(ВыпискаДокумент.Дата, Отбор).ФизическоеЛицо;
	Иначе
		ОтветственноеЛицо = ТекПользователь.ФизЛицо;
	КонецЕсли;
	
	стПараметры.Вставить("ФИО", ?(ОтветственноеЛицо = Неопределено, ПараметрыСеанса.ТекущийПользователь.ПолноеНаименование(), ОтветственноеЛицо.Наименование));
	
	Если Контрагент.ОтчетыНаАнглийскомЯзыке Тогда
		стПараметры.ФИО = стПараметры.ФИО + " / " + ОбщегоНазначенияКлиентСервер.Транслит(стПараметры.ФИО);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыпискаДокумент) Тогда
		стПараметры.Вставить("Поручение", "№ " + СокрЛП(ВыпискаДокумент.ДокументОснование.Номер) + " от "
			+ Формат(ВыпискаДокумент.ДокументОснование.Дата,"ДЛФ=D"));
		стПараметры.Поручение = "Поручение " + стПараметры.Поручение;
		стПараметры.Вставить("ДопИнформация", СокрЛП(ВыпискаДокумент.ДокументОснование.Комментарий));
		стПараметры.Вставить("РегНомерПоручения", СокрЛП(ВыпискаДокумент.ДокументОснование.ВходящийНомерПоручения));
		стПараметры.Вставить("Операция", "№ " + СокрЛП(ВыпискаДокумент.Номер) + " от "+Формат(ВыпискаДокумент.Дата,"ДЛФ=D"));
	КонецЕсли;
	
	Период = ?(ЗначениеЗаполнено(ВыпискаДокумент), ВыпискаДокумент.Дата, КонПериода);
	
	ФормированиеПечатныхФорм.СформироватьДатуВремяДДММГГЧЧММ(стПараметры, "", Период);
	
	Если СчетДепо.ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетДЕПО Тогда
		стПараметры.Вставить("РеквизитыПриказа", РегистрыСведений.РеквизитыПриказовПриложенийКРДО.Реквизиты(Период));
	КонецЕсли;
	
	Возврат стПараметры;
	
КонецФункции

Функция ПолучитьАктивныеОтборы()
	
	стВозврата = Новый Структура();
	ЭлементыОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	Для Каждого эл Из ЭлементыОтбора Цикл
		Если эл.Использование и ЗначениеЗаполнено(эл.ПравоеЗначение) Тогда
			стВозврата.Вставить(эл.ЛевоеЗначение, эл.ПравоеЗначение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат стВозврата;
	
КонецФункции

Функция ПолучитьИмяМакета(Контрагент, ДатаОснования)
	
	ЗначениеПоУмолчанию = ДАТА(1, 1, 1);
	ДатаПереходаНаПечатнуюФорму2026 =
		РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("3490.ДатаПереходаНаПечатныеФормыВыписок2026",
			ЗначениеПоУмолчанию);
	
	Если ДатаОснования >= ДатаПереходаНаПечатнуюФорму2026 Тогда
		ИмяМакета = "Макет2026";
	Иначе
		ИмяМакета = "Макет2017";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) И Контрагент.ОтчетыНаАнглийскомЯзыке Тогда
		ИмяМакета = ИмяМакета + "en";
	КонецЕсли;
	
	Возврат ИмяМакета;
	
КонецФункции

Процедура ПоместитьОтчетыВЭдо() Экспорт // BSLLS:Typo-off
	
	ТипДокумента = "DepoAccountOperations";
	
	ФормированиеОтчетовОСовершенныхОперациях = Обработки.ФормированиеОтчетовОСовершенныхОперациях.Создать();
	ФормированиеОтчетовОСовершенныхОперациях.ПоместитьОтчетыВKafka(ТипДокумента, ДокументыКЭДО, ВыводитьФаксимилеВОтчетах);
	
	Для Каждого СтрокаРезультата Из ДокументыКЭДО Цикл
		Если ЗначениеЗаполнено(СтрокаРезультата.ТекстОшибки) Тогда
			ШаблонОшибки = "Отчет [%1] по счету депо [%2] не отправлен в ЭДО по причине: %3";
			ТекстОшибки = СтрШаблон(ШаблонОшибки, ТипДокумента, СокрЛП(СтрокаРезультата.СчетДепо), СтрокаРезультата.ТекстОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

// Таблица значений для вывода остатков по счету депо.
ТаблицаЗначенийОстаткиНаКонец = Новый ТаблицаЗначений;
ТаблицаЗначенийОстаткиНаКонец.Колонки.Добавить("ЦБ", Новый ОписаниеТипов("СправочникСсылка.ЦенныеБумаги"));
ТаблицаЗначенийОстаткиНаКонец.Колонки.Добавить("ГосНомер");
ТаблицаЗначенийОстаткиНаКонец.Колонки.Добавить("МХ");
ТаблицаЗначенийОстаткиНаКонец.Колонки.Добавить("РС");
ТаблицаЗначенийОстаткиНаКонец.Колонки.Добавить("КолНеОбр");
ТаблицаЗначенийОстаткиНаКонец.Колонки.Добавить("КолОбр");
ТаблицаЗначенийОстаткиНаКонец.Колонки.Добавить("КолЗалог");
ТаблицаЗначенийОстаткиНаКонец.Колонки.Добавить("КолВПути");
ТаблицаЗначенийОстаткиНаКонец.Колонки.Добавить("РазделСчетаДЕПО");

// Таблица значений для вывода операций за период.
ТаблицаЗначенийОперации = Новый ТаблицаЗначений;
ТаблицаЗначенийОперации.Колонки.Добавить("ДатаВремя");
ТаблицаЗначенийОперации.Колонки.Добавить("НомерПроводки");
ТаблицаЗначенийОперации.Колонки.Добавить("ВидОперации",	Новый ОписаниеТипов("СправочникСсылка.ВидыОпераций"));
ТаблицаЗначенийОперации.Колонки.Добавить("ЦБ",			Новый ОписаниеТипов("СправочникСсылка.ЦенныеБумаги"));
ТаблицаЗначенийОперации.Колонки.Добавить("ВидВыпускЦБ");
ТаблицаЗначенийОперации.Колонки.Добавить("Зачислено");
ТаблицаЗначенийОперации.Колонки.Добавить("Списано");
ТаблицаЗначенийОперации.Колонки.Добавить("Основание");
ТаблицаЗначенийОперации.Колонки.Добавить("Регистратор");
ТаблицаЗначенийОперации.Колонки.Добавить("РазделСчета");
ТаблицаЗначенийОперации.Колонки.Добавить("РазделСчетаДЕПО");

ДатаВыписки = "-----";
НомерВыписки = "Б/Н";

мТекстыЗаголовков = ФормированиеПечатныхФорм.ТекстыЗаголовковОтчетов(ПолучитьМакет("Заголовки").ПолучитьТекст());
ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
